app/controllers/shoppinglists_controller.rb

SELECT "shoppinglists".* FROM "shoppinglists"
---
  def index
    @shoppinglists = Shoppinglist.all

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."shoppinglist_id" = ?  [["shoppinglist_id", 1]]
---
   def show
    #@shoppinglist = Shoppinglist.find_by(id: params["id"])
    #@items = @shoppinglist.items

    @shoppinglist = Shoppinglist.find_by(id: params["id"])
    @items = @shoppinglist.items
    @recipes = []
    @items.each do |item|

INSERT INTO "shoppinglists" ("name") VALUES (?)  [["name", ""]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    shoppinglist_params = params.require(:shoppinglist).permit!
    Shoppinglist.create(shoppinglist_params)
    @user = User.find_by(id: current_user.id)

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @shoppinglist = Shoppinglist.find_by(id: params["id"])