app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]